# -----------------ADVANCED DATAFRAMES EXERCISES I----------------------

Run python -m pip install pymysql from your terminal to install pymysql.

Create a notebook or python script named advanced_dataframes to do your work in for these exercises.

Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)


cd into your exercises folder for this module and run echo env.py >> .gitignore

In [32]:
import pandas as pd
import numpy as np

In [11]:
from env import host, user, password

In [12]:
url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [13]:
employees_query = 'SELECT * FROM employees LIMIT 5 OFFSET 50'

pd.read_sql(employees_query, url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

3). Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

Use your function to obtain a connection to the employees database.

Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?


Answer: OperationalError

In [144]:
employees_database = 'employees'

def get_db_url(username, host, password, employees_database):
    
    return f'mysql+pymysql://{user}:{password}@{host}/employees'

In [138]:
get_db_url(user,host,password,employees_database)

'mysql+pymysql://innis_1672:rpn487rUMAqvPsjCphhynfU9LMTUtcqv@data.codeup.com/employees'

In [139]:
pd.read_sql('Select * from employees Limit 5', get_db_url(user,host,password,employees_database))

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

b. Intentionally make an error in your SQL query. What does the error message look like?

Answer: 

ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.empoyees' doesn't exist")
[SQL: Select * from empoyees Limit 5]
(Background on this error at: https://sqlalche.me/e/14/f405)

6). Read the employees and titles tables into two separate DataFrames.

In [19]:
employees_data_frame = pd.DataFrame(pd.read_sql('Select * from employees', get_db_url(user,host,password,employees_database)))
employees_data_frame

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [20]:
titles_database = 'titles'

titles_data_frame = pd.DataFrame(pd.read_sql('Select * from titles', get_db_url(user,host,password,titles_database)))
titles_data_frame

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

7). How many rows and columns do you have in each DataFrame? Is that what you expected?

In [24]:
employees_data_frame.shape

(300024, 6)

In [25]:
titles_data_frame.shape

(443308, 4)

8). Display the summary statistics for each DataFrame.

In [26]:
employees_data_frame.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [27]:
titles_data_frame.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

9). How many unique titles are in the titles DataFrame?

In [28]:
titles_data_frame.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

10). What is the oldest date in the to_date column?

In [29]:
titles_data_frame.to_date.min()

datetime.date(1985, 3, 1)

11). What is the most recent date in the to_date column?

In [30]:
titles_data_frame.to_date.max()

datetime.date(9999, 1, 1)

# ----------------------ADVANCED DATAFRAME EXERCISE II-----------------------

1). Copy the users and roles DataFrames from the examples above.

In [34]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [35]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

2). What is the result of using a right join on the DataFrames?

In [39]:
users.merge(roles, left_on='role_id', right_on='id', how='right', indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

3). What is the result of using an outer join on the DataFrames?

In [43]:
users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator = True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

4). What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [47]:
users.merge(roles, left_on='role_id', right_on='id', how='right', indicator=True).drop(columns = 'role_id')

   id_x name_x  id_y     name_y      _merge
0   1.0    bob     1      admin        both
1   2.0    joe     2     author        both
2   3.0  sally     3   reviewer        both
3   4.0   adam     3   reviewer        both
4   NaN    NaN     4  commenter  right_only

5). Load the mpg dataset from PyDataset.

In [120]:
from pydataset import data

mpg = data('mpg')

6). Output and read the documentation for the mpg dataset.

In [121]:
mpg = pd.DataFrame(mpg)
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

7). How many rows and columns are in the dataset?

In [122]:
mpg.shape

(234, 11)

8). Check out your column names and perform any cleanup you may want on them.

In [402]:
# mpg.columns.tolist()

[print(i) for i in mpg.columns]

manufacturer
model
displ
year
cyl
trans
drv
cty
hwy
fl
class
mileage_difference
average_mileage
is_automatic

[None,
 None,
 None,
 None,
 None,
 None,
 None,
 None,
 None,
 None,
 None,
 None,
 None,
 None]

9). Display the summary statistics for the dataset.

In [123]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

10). How many different manufacturers are there?

In [124]:
mpg.manufacturer.unique()

array(['audi', 'chevrolet', 'dodge', 'ford', 'honda', 'hyundai', 'jeep',
       'land rover', 'lincoln', 'mercury', 'nissan', 'pontiac', 'subaru',
       'toyota', 'volkswagen'], dtype=object)

11). How many different models are there?

In [412]:
unique_models = mpg.model.unique()
# type(unique_models)
unique_models

array(['a4', 'a4 quattro', 'a6 quattro', 'c1500 suburban 2wd', 'corvette',
       'k1500 tahoe 4wd', 'malibu', 'caravan 2wd', 'dakota pickup 4wd',
       'durango 4wd', 'ram 1500 pickup 4wd', 'expedition 2wd',
       'explorer 4wd', 'f150 pickup 4wd', 'mustang', 'civic', 'sonata',
       'tiburon', 'grand cherokee 4wd', 'range rover', 'navigator 2wd',
       'mountaineer 4wd', 'altima', 'maxima', 'pathfinder 4wd',
       'grand prix', 'forester awd', 'impreza awd', '4runner 4wd',
       'camry', 'camry solara', 'corolla', 'land cruiser wagon 4wd',
       'toyota tacoma 4wd', 'gti', 'jetta', 'new beetle', 'passat'],
      dtype=object)

In [413]:
mpg.model.value_counts()

caravan 2wd               11
ram 1500 pickup 4wd       10
civic                      9
jetta                      9
dakota pickup 4wd          9
mustang                    9
impreza awd                8
a4 quattro                 8
grand cherokee 4wd         8
a4                         7
toyota tacoma 4wd          7
camry solara               7
camry                      7
tiburon                    7
sonata                     7
passat                     7
f150 pickup 4wd            7
durango 4wd                7
explorer 4wd               6
new beetle                 6
altima                     6
4runner 4wd                6
forester awd               6
gti                        5
c1500 suburban 2wd         5
corolla                    5
corvette                   5
malibu                     5
grand prix                 5
k1500 tahoe 4wd            4
pathfinder 4wd             4
mountaineer 4wd            4
range rover                4
maxima                     3
navigator 2wd              3
a6 quattro                 3
expedition 2wd             3
land cruiser wagon 4wd     2
Name: model, dtype: int64

12). Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between 
highway and city mileage for each car.

In [126]:
mpg['mileage_difference'] = mpg.hwy - mpg.cty
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

13). Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the 
city and highway mileage.

In [420]:
mpg['average_mileage'] = ((mpg.cty + mpg.hwy) / 2)
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,False
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,False
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,False
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,False
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,False


14). Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic
transmission.

In [426]:
# Alternate way
# mpg['is_automatic'] = mpg.trans == 'auto'
# mpg



mpg['is_automatic'] = np.where(mpg.trans.str.startswith('a'), 'Automatic Trans', 'Manual Trans')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,Automatic Trans
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,Manual Trans
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,Manual Trans
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,Automatic Trans
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,Automatic Trans
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,Automatic Trans
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,Manual Trans
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,Automatic Trans
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,Manual Trans
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,Automatic Trans

15). Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [435]:
# mpg.average_mileage.nlargest()
mpg.groupby('manufacturer').average_mileage.mean().sort_values(ascending=False)

manufacturer
honda         28.500000
volkswagen    25.074074
hyundai       22.750000
subaru        22.428571
audi          22.027778
toyota        21.720588
pontiac       21.700000
nissan        21.346154
chevrolet     18.447368
ford          16.680000
mercury       15.625000
jeep          15.562500
dodge         15.540541
lincoln       14.166667
land rover    14.000000
Name: average_mileage, dtype: float64

In [428]:
mpg.describe(exclude=np.number)

       manufacturer        model     trans  drv   fl class     is_automatic
count           234          234       234  234  234   234              234
unique           15           38        10    3    5     7                2
top           dodge  caravan 2wd  auto(l4)    f    r   suv  Automatic Trans
freq             37           11        83  106  168    62              157

In [429]:
mpg.describe()

,displ,year,cyl,cty,hwy,mileage_difference,average_mileage
count,234.000000,234.000000,234.000000,234.000000,234.000000,234.000000,234.000000
mean,3.471795,2003.500000,5.888889,16.858974,23.440171,6.581197,20.149573
std,1.291959,4.509646,1.611534,4.255946,5.954643,2.262739,5.050290
min,1.600000,1999.000000,4.000000,9.000000,12.000000,2.000000,10.500000
25%,2.400000,1999.000000,4.000000,14.000000,18.000000,5.000000,15.500000
50%,3.300000,2003.500000,6.000000,17.000000,24.000000,7.000000,20.500000
75%,4.600000,2008.000000,8.000000,19.000000,27.000000,8.000000,23.500000
max,7.000000,2008.000000,8.000000,35.000000,44.000000,12.000000,39.500000

16). Do automatic or manual cars have better miles per gallon?

In [148]:
mpg.groupby(['trans', 'mileage_difference']).mileage_difference.agg(['max','count'])

                               max  count
trans      mileage_difference
auto(av)   6                     6      1
           7                     7      1
           8                     8      1
           9                     9      2
auto(l3)   6                     6      2
auto(l4)   3                     3      6
           4                     4     22
           5                     5      7
           6                     6     14
           7                     7     13
           8                     8     13
           9                     9      3
           10                   10      3
           11                   11      1
           12                   12      1
auto(l5)   3                     3      9
           4                     4      8
           5                     5      6
           6                     6      3
           7                     7      1
           8                     8      1
           9                     9      3
           10                   10      4
           11                   11      3
           12                   12      1
auto(l6)   6                     6      4
           7                     7      2
auto(s4)   5                     5      1
           7                     7      1
           9                     9      1
auto(s5)   6                     6      1
           9                     9      2
auto(s6)   5                     5      1
           6                     6      2
           7                     7      3
           8                     8      4
           9                     9      5
           10                   10      1
manual(m5) 2                     2      3
           3                     3      3
           4                     4      1
           5                     5      5
           6                     6      5
           7                     7     10
           8                     8     21
           9                     9      5
           10                   10      4
           11                   11      1
manual(m6) 3                     3      2
           4                     4      3
           6                     6      1
           8                     8      7
           9                     9      2
           10                   10      3
           11                   11      1

# ----------------- Exercises III------------------

1). Use your get_db_url function to help you explore the data from the chipotle database.

In [233]:
chipotle_database = 'chipotle'


def get_db_url(username, host, password, employees_database):
    
    return f'mysql+pymysql://{user}:{password}@{host}/chipotle'
      
chipotle_database = 'chipotle'

chipotle_dataframe = pd.DataFrame(pd.read_sql('Select * from orders', get_db_url(user,host,password,chipotle_database)))
chipotle_dataframe

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

2). What is the total price for each order?

In [261]:
chipotle_dataframe.item_price = chipotle_dataframe.item_price.replace('[$]','')

chipotle_dataframe['item_price'] = chipotle_dataframe['item_price'].astype('float')

chipotle_dataframe['total_price']= chipotle_dataframe.groupby(['order_id','item_name']).item_price.transform('sum')

chipotle_dataframe

,id,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39,2.39
1,2,1,1,Izze,[Clementine],3.39,3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98,16.98
...,...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",11.75,23.50
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",11.75,23.50
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",11.25,28.75
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",8.75,28.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",8.75,28.75

3). What are the most popular 3 items?

In [313]:
meal_likability = (pd.crosstab(chipotle_dataframe.quantity, chipotle_dataframe.item_name).max().T)
meal_likability.nlargest(3)

item_name
Chicken Bowl           693
Chicken Burrito        521
Chips and Guacamole    455
dtype: int64

4). Which item has produced the most revenue?

In [288]:
chipotle_dataframe.groupby(['item_name','item_price']).total_price.nlargest(1)

item_name          item_price
6 Pack Soft Drink  6.49        298      6.49
                   12.98       3389    12.98
Barbacoa Bowl      8.69        3195     8.69
                   8.99        115      8.99
                   9.25        1417    27.75
                                       ...
Veggie Salad Bowl  11.25       186     11.25
Veggie Soft Tacos  8.49        1395     8.49
                   8.75        781      8.75
                   11.25       738     11.25
                   16.98       3889    16.98
Name: total_price, Length: 209, dtype: float64

5). Join the employees and titles DataFrames together.

In [282]:
employees_title = (employees_data_frame.merge(titles_data_frame, left_on='emp_no', right_on='emp_no', how='inner', indicator=True))
employees_title

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date,_merge
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01,both
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01,both
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01,both
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01,both
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01,both
...,...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29,both
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01,both
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01,both
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27,both
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01,both

6). For each title, find the hire date of the employee that was hired most recently with that title.

In [437]:
employees_title.groupby('title').hire_date.max()

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

In [392]:
employees_title.hire_date == '9999-01-01'

0         False
1         False
2         False
3         False
4         False
          ...
443303    False
443304    False
443305    False
443306    False
443307    False
Name: hire_date, Length: 443308, dtype: bool

7). Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this 
will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)